app/controllers/articles_controller.rb

	def create
		@article = Article.new(params[:article])
		# TODO, make if check, render:new if fails
		@article.save
---
INSERT INTO "articles" ("content", "created_at", "header", "updated_at") VALUES (?, ?, ?, ?)  [["content", "heipådeg"], ["created_at", Thu, 23 Mar 2017 17:50:39 UTC +00:00], ["header", "hei"], ["updated_at", Thu, 23 Mar 2017 17:50:39 UTC +00:00]]